app/views/disbursement_mailer/driver_disburse_email.html.erb

SELECT "carpools".* FROM "carpools" WHERE "carpools"."user_id" = ?  [["user_id", 1]]
---

        <% @user.carpools.each do |c| %><br>