app/controllers/api/v1/rides_controller.rb

SELECT "rides".* FROM "rides"
---
  def index

    if params[:date] && params[:departure] && params[:arrival]
      # params[:date] = params[:date].to_date
      # @rides = Ride.filter(params.slice(:ride_date, :departure_location, :arrival_location))
      @rides = Ride.where("ride_date LIKE (?) AND departure_location LIKE (?) AND arrival_location LIKE (?)", params[:date].to_date, params[:departure], params[:arrival])
    else
      @rides = Ride.all